TexasInstruments/ind-comms-sdk/examples/industrial_comms/ethercat_iolink_gateway_demo/am243x-evm/r5fss0-0_freertos/example.syscfg
gpio3.$name          = "CONFIG_IOL_TX2";
gpio3.pinDir         = "OUTPUT";
gpio3.GPIO_n.$assign = "PRG0_PRU0_GPO11";

gpio4.$name          = "CONFIG_IOL_TX3";
gpio4.pinDir         = "OUTPUT";
gpio4.GPIO_n.$assign = "PRG0_PRU0_GPO12";

gpio5.$name          = "CONFIG_IOL_TX4";
gpio5.pinDir         = "OUTPUT";
gpio5.GPIO_n.$assign = "PRG0_PRU0_GPO13";

gpio6.$name          = "CONFIG_IOL_TX5";
gpio6.pinDir         = "OUTPUT";
gpio6.GPIO_n.$assign = "PRG0_PRU0_GPO14";

gpio7.$name          = "CONFIG_IOL_TX6";
gpio7.pinDir         = "OUTPUT";
gpio7.GPIO_n.$assign = "PRG0_PRU0_GPO15";

gpio8.$name          = "CONFIG_IOL_TX7";
gpio8.pinDir         = "OUTPUT";
gpio8.GPIO_n.$assign = "PRG0_PRU0_GPO16";

gpio9.$name          = "CONFIG_IOL_TX8";
gpio9.pinDir         = "OUTPUT";
gpio9.GPIO_n.$assign = "PRG0_PRU0_GPO17";

gpio10.$name          = "CONFIG_IOL_RX1";
gpio10.rx             = true;
gpio10.GPIO_n.$assign = "PRG0_PRU0_GPO0";

gpio11.$name          = "CONFIG_IOL_RX2";
gpio11.rx             = true;
gpio11.GPIO_n.$assign = "PRG0_PRU0_GPO1";

gpio12.$name          = "CONFIG_IOL_RX3";
gpio12.rx             = true;
gpio12.GPIO_n.$assign = "PRG0_PRU0_GPO2";

gpio13.$name          = "CONFIG_IOL_RX4";
gpio13.rx             = true;
gpio13.GPIO_n.$assign = "PRG0_PRU0_GPO3";

gpio14.$name          = "CONFIG_IOL_RX5";
gpio14.rx             = true;
gpio14.GPIO_n.$assign = "PRG0_PRU0_GPO4";

gpio15.$name          = "CONFIG_IOL_RX6";
gpio15.rx             = true;
gpio15.GPIO_n.$assign = "PRG0_PRU0_GPO5";

gpio16.$name          = "CONFIG_IOL_RX7";
gpio16.rx             = true;
gpio16.GPIO_n.$assign = "PRG0_PRU0_GPO6";

gpio17.$name          = "CONFIG_IOL_RX8";
gpio17.rx             = true;
gpio17.GPIO_n.$assign = "PRG0_PRU0_GPO7";

gpio18.$name          = "CONFIG_IOL_TXEN1";
gpio18.pinDir         = "OUTPUT";
gpio18.GPIO_n.$assign = "PRG0_PRU1_GPO6";

gpio19.$name          = "CONFIG_IOL_TXEN2";
gpio19.pinDir         = "OUTPUT";
gpio19.GPIO_n.$assign = "PRG0_PRU1_GPO8";

gpio20.$name          = "CONFIG_IOL_TXEN3";
gpio20.pinDir         = "OUTPUT";
gpio20.GPIO_n.$assign = "PRG0_PRU1_GPO11";

gpio21.$name          = "CONFIG_IOL_TXEN4";
gpio21.pinDir         = "OUTPUT";
gpio21.GPIO_n.$assign = "PRG0_PRU1_GPO12";

gpio22.$name          = "CONFIG_IOL_TXEN5";
gpio22.pinDir         = "OUTPUT";
gpio22.GPIO_n.$assign = "PRG0_PRU1_GPO13";

gpio23.$name          = "CONFIG_IOL_TXEN6";
gpio23.pinDir         = "OUTPUT";
gpio23.GPIO_n.$assign = "PRG0_PRU1_GPO14";

gpio24.$name          = "CONFIG_IOL_TXEN7";
gpio24.pinDir         = "OUTPUT";
gpio24.GPIO_n.$assign = "PRG0_PRU1_GPO15";

gpio25.$name          = "CONFIG_IOL_TXEN8";
gpio25.pinDir         = "OUTPUT";
gpio25.GPIO_n.$assign = "PRG0_PRU1_GPO16";

gpio26.$name          = "CONFIG_IOL_ENL1";
gpio26.pinDir         = "OUTPUT";
gpio26.rx             = true;
gpio26.GPIO_n.$assign = "PRG0_PRU0_GPO18";

gpio27.$name          = "CONFIG_IOL_ENL2";
gpio27.pinDir         = "OUTPUT";
gpio27.GPIO_n.$assign = "PRG0_PRU0_GPO19";

gpio28.$name          = "CONFIG_IOL_ENL3";
gpio28.pinDir         = "OUTPUT";
gpio28.GPIO_n.$assign = "PRG0_PRU1_GPO0";

gpio29.$name          = "CONFIG_IOL_ENL4";
gpio29.pinDir         = "OUTPUT";
gpio29.GPIO_n.$assign = "PRG0_PRU1_GPO1";

gpio30.$name          = "CONFIG_IOL_ENL5";
gpio30.pinDir         = "OUTPUT";
gpio30.GPIO_n.$assign = "PRG0_PRU1_GPO2";

gpio31.$name          = "CONFIG_IOL_ENL6";
gpio31.pinDir         = "OUTPUT";
gpio31.GPIO_n.$assign = "PRG0_PRU1_GPO3";

gpio32.$name          = "CONFIG_IOL_ENL7";
gpio32.pinDir         = "OUTPUT";
gpio32.GPIO_n.$assign = "PRG0_PRU1_GPO4";

gpio33.$name          = "CONFIG_IOL_ENL8";
gpio33.pinDir         = "OUTPUT";
gpio33.GPIO_n.$assign = "PRG0_PRU1_GPO5";

gpio34.$name          = "CONFIG_IOL_FAULTN1";
gpio34.pu_pd          = "pu";
gpio34.rx             = true;
gpio34.GPIO_n.$assign = "GPMC0_AD0";

gpio35.$name          = "CONFIG_IOL_FAULTN2";
gpio35.pu_pd          = "pu";
gpio35.rx             = true;
gpio35.GPIO_n.$assign = "GPMC0_AD1";

gpio36.$name          = "CONFIG_IOL_FAULTN3";
gpio36.pu_pd          = "pu";
gpio36.rx             = true;
gpio36.GPIO_n.$assign = "GPMC0_AD2";

gpio37.$name          = "CONFIG_IOL_FAULTN4";
gpio37.pu_pd          = "pu";
gpio37.rx             = true;
gpio37.GPIO_n.$assign = "GPMC0_AD3";

gpio38.$name          = "CONFIG_IOL_FAULTN5";
gpio38.pu_pd          = "pu";
gpio38.rx             = true;
gpio38.GPIO_n.$assign = "GPMC0_AD4";

gpio39.$name          = "CONFIG_IOL_FAULTN6";
gpio39.pu_pd          = "pu";
gpio39.rx             = true;
gpio39.GPIO_n.$assign = "GPMC0_AD5";

gpio40.$name          = "CONFIG_IOL_FAULTN7";
gpio40.pu_pd          = "pu";
gpio40.rx             = true;
gpio40.GPIO_n.$assign = "GPMC0_AD6";

gpio41.$name          = "CONFIG_IOL_FAULTN8";
gpio41.pu_pd          = "pu";
gpio41.rx             = true;
gpio41.GPIO_n.$assign = "GPMC0_AD7";

i2c1.$name           = "CONFIG_I2C1";
i2c1.I2C.$assign     = "I2C1";
i2c1.I2C.SCL.$assign = "I2C1_SCL";
i2c1.I2C.SDA.$assign = "I2C1_SDA";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template1";

i2c2.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c2;
led1.peripheralDriver    = i2c2;
led2.peripheralDriver    = i2c2;
led3.peripheralDriver    = i2c2;
led5.peripheralDriver    = i2c2;
led6.peripheralDriver    = i2c2;
i2c2.I2C.$assign         = "I2C0";
i2c2.I2C.SCL.$assign     = "I2C0_SCL";
i2c2.I2C.SDA.$assign     = "I2C0_SDA";
i2c2.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template2";

mcspi1.$name                       = "CONFIG_MCSPI_IOL";
mcspi1.mode                        = "MULTI_CONTROLLER";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI1";
mcspi1.SPI.CLK.$assign             = "SPI1_CLK";
mcspi1.SPI.D0.$assign              = "SPI1_D0";
mcspi1.SPI.D1.$assign              = "SPI1_D1";
mcspi1.child.$name                 = "drivers_mcspi_v0_mcspi_v0_template0";
mcspi1.mcspiChannel.create(2);
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].CSn.$assign = "SPI1_CS0";
mcspi1.mcspiChannel[1].$name       = "CONFIG_MCSPI_CH1";
mcspi1.mcspiChannel[1].CSn.$assign = "SPI1_CS1";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

